[
  {
    "id": "1",
    "title": "Difference between Node.JS and Javascript.",
    "img": "https://i.ibb.co/nQSfFVh/01jsimage.jpg",
    "answer": "NodeJS is a cross-platform as well as open-source Javascript runtime environment that allows the javascript to be run on the server-side efficiently. Further Nodejs allows Javascript code to run outside the browser smoothly. Finally, we can say that Nodejs comes with a lot of modules and is mostly used in web development, especially for backend engineers. On the other hand, Javascript is a Scripting language, which is shortly called JS. It is often said that Javascript is the updated version of the ECMA script. Developed based on prototype inheritance Javascript is a high-level programming language, and it uses for the concept of Oops.Difference between Nodejs and JavaScript: Javascript is a programming language that is used for writing scripts on a website, where NodeJS is a Javascript runtime environment. Javascript can only be run in the browsers, and we can run Javascript outside the browser with the help of NodeJS. Javascript is basically used on the client side, and NodeJS is mostly used on the server-side. Javascript is capable enough to add HTML and play with the DOM. Nodejs does not have the capability to add HTML tags. Javascript can run in any browser engine like JS core in safari and Spidermonkey in Firefox. V8 is the Javascript engine inside of node.js that parses and runs Javascript."
  },
  {
    "id": "2",
    "title": "When should we use nodejs and when should we use mongodb?",
    "img": "https://i.ibb.co/K5YWKW6/02nodejsimage.jpg",
    "answer": "Nodejs is a Javascript engine that we can write any application we want. It runs our code. Most commonly, it is used to build servers that can respond to web requests, though it can be used for lots of other types of code too.MongoDB is a database engine. Code within some application or server uses MongoDB to save, query, or update data in a database. There are many web servers built with nodejs that will then use MongoDB for storing data.MongoDB offers an API library that runs within a Nodejs to give you programmatic access to MongoDB so you can create databases and then add, query, update or delete data from the MongoDB database. MongoDB also has API libraries for other programming environments such as Python, Java, etc...These two technologies are for different parts of a typical web server system. We don't substitute one for the other. Instead, but we can use them together. "
  },
  {
    "id": "3",
    "title": "Differences between sql and nosql databases.",
    "img": "https://i.ibb.co/sP321JW/03sqlimage.jpg",
    "answer": "Structured Query language (SQL) and NoSQL is a non-relational DMS, which does not require a fixed schema, avoids joins, and are easy to scale. SQL databases are primarily called RDBMS or Relational Databases, and NoSQL databases are primarily called Non-relational or distributed databases. Traditional Relational Database Management System (RDBMS) uses SQL syntax and queries to analyze and get the data for further insights. They are used for OLAP systems, and the NoSQL database system consists of various kinds of database technologies. These databases were developed in response to the demands presented for the development of the modern application. SQL databases are table-based databases, and NoSQL databases can be document-based, key-value pairs, and graph databases. SQL databases have a predefined schema, and NoSQL databases use dynamic schema for unstructured data. "
  },
  {
    "id": "4",
    "title": "What is the purpose of jwt and how does it work?",
    "img": "https://i.ibb.co/qnT7Jbj/04jwtimage.jpg",
    "answer": "The true purpose of JSON Web Commemoratives is veritably important in the case of a comparison of two approaches in the authentication. JWT, or JSON Web Token, is an open standard used to partake security information between two parties — a customer and a garçon. Each JWT contains decoded JSON objects, including a set of claims. JWTs are inked using a cryptographic algorithm to insure that the claims can not be altered after the commemorative is issued. While there are numerous good papers available that describe specific aspects, stylish practices, or single use-cases of JWTs, the bigger picture is frequently missing. The factual problem that JWT specs try to break is just not part of utmost conversations. With JWTs gaining in fashionability, still, that missing knowledge of the abecedarian ideas of JSON Web Token leads to serious questions. In the old days of the Web, authentication was a pure stateful affair. With a centralized overlord reality being responsible for commemoratives, the world was fairly simple. Commemoratives are issued and stored in a single service for unborn checking and cancellation, Guests and resource waiters know a single point of verity for token verification and information gathering. This worked rather well in a world of integrated systems (some might call them the heritage app, mothership, or simply Rudra when waiters rendered frontends and dependences was one.g. package- position and not between singly stationed operations. "
  }
]